{
  "home": "Home",
  "about": "About",
  "aboutme": "About Me",
  "blog": "Blog",
  "contact": "Contact",
  "login": "Login",
  "register": "Register",
  "openmenu": "Open Menu",
  "homewelcome": "Welcome to my world",
  "Software Engineer": "Software Engineer",
  "PHP Developer": "PHP Developer",
  "Web Developer": "Web Developer",
  "Full Stack Developer": "Full Stack Developer",
  "a_welcome": "a",
  "hi_welcome": "Hi, I'm",
  "description": "Description",
  "contribution": "Contribution",
  "technologies": "Technologies",
  "view project": "View Project",
  "Coming soon": "Coming Soon",
  "Send": "Send",
  "changelang": "Change Language",
  "contactme": {
    "title": "Want to get in touch?",
    "label": "Your message",
    "content": "Hi, I'm interested in your professional profile because...",
    "emailsubject": "FB - Contact via portfolio"
  },
  "dates": {
    "start": "Start Date",
    "end": "End Date",
    "present": "Present"
  },
  "aboutme_content": "Computer Science Engineer graduated from CUCEI, University of Guadalajara, with strong technical background and professional experience in Web Development.\nMy focus is on building clean, scalable and business-oriented solutions using modern technologies, guided by a clear work philosophy:",
  "dont_be_a_coder": "Don't be a coder, be a programmer",
  "projects": {
    "header" : "My Portfolio",
    "sub_header" : "Explore my professional contributions and project portfolio",
    "mimo": {
      "title": "MIMO - Motorcycles",
      "description": "Management platform for motorcycle dealerships",
      "long_description": "Application that manages Groups and Dealers, centralizing their information such as contacts, social networks, addresses, schedules, etc. The platform allows the generation of websites for each Group based on their domain, with options to manage banners (both general and group-specific), and add promotions.\n\nEach main site has its own Landing Page, banners, a model/product list, and a map of group branches, among other views.\n\nThe main site allows potential customers to create Leads for specific products. Customer information is encrypted to ensure privacy. On the admin side, an intuitive CRM was developed for Lead tracking, with a multi-level role system that ensures confidentiality. An innovative search method was implemented to manage encrypted data efficiently.\n\nThe application also includes endpoints to receive Leads from various external applications, centralizing motorcycle data and simplifying statistical analysis.\n\nThe system was built with an extensible structure to easily support future functionality additions.",
      "contribution": "I participated in the creation of the application from its initial phase, from the analysis for the implementation of the application to its actual implementation, including the deployment to production. During the entire development process, I made decisions, managed resources, and handled problem analysis and resolution.\n\nOn the technical side, what I can highlight is the implementation of a solid foundation using design patterns such as the Repository Pattern and the Decorator Pattern, along with the use of DTOs (Data Transfer Objects) and VOs (Value Objects). This made it possible to establish a scalable and easy-to-maintain structure as the project grew.\n\nI also implemented Laravel Scout to improve searches within the admin panel, especially in the leads module, using Meilisearch as the driver. I configured the service and deployed it directly to the server.\n\nCurrently, I continue to maintain the application for optimization and improvement, creating new modules, such as building algorithms to automate the site."
    },
    "ekar": {
      "title": "Ekar de Gas",
      "description": "E-commerce platform for a historic company in Jalisco.",
      "long_description": "Custom-built e-commerce application for Ekar de Gas, integrating all the essential components of an online store: products, brands, categories, reviews, stock, warehouses, customers, orders, shipping methods, payment methods, among others.\nThe application includes the added value of a direct connection with SAP for managing products, warehouse stock, prices, discounts, and automatic order creation.",
      "contribution": "Among my contributions, I highlight the integration with SAP, which was a new and intensive challenge for me. It involved a direct connection using XML and RAW queries to the database. This required a significant amount of research to understand and implement everything necessary to achieve a working connection with SAP.\nOn the other hand, I worked on the creation of a package to handle the shopping cart, as well as the full implementation of the checkout process.\n\nThis was my first real experience with an e-commerce project, and I learned a lot about what it takes to build an online store from scratch. I’m currently still maintaining the application, improving modules, performing optimizations, and I also developed a new package to support the integration of the new payment method with Mercado Pago."
    },
    "tubin": {
      "title": "Tubin",
      "description": "Ecommerce Platform",
      "long_description": "",
      "contribution": "I developed the backend using Laravel and optimized inventory processes."
    },
    "solarudg": {
      "title": "Solar UDG",
      "description": "Final university project",
      "long_description": "In collaboration with an internal development team from CUCEI, I had the privilege of participating in the design and development of an administrative system, whose main purpose is the centralized monitoring of all photovoltaic systems installed across the campuses of the University of Guadalajara.\nThe system was efficiently organized, grouping photovoltaic systems by campus and providing accurate information on energy generation in real time, monthly, and for specific time periods. To ensure accessibility and clear visualization of relevant data, we created dynamic charts that allow for an intuitive understanding of photovoltaic performance.\nOne of the key features of this project was the implementation of APIs to obtain and process essential data. In addition, a functionality was developed to upload and process files from the Comisión Federal de Electricidad (CFE), using intelligent algorithms that extract and clean valuable data for further analysis.",
      "contribution": "Among my contributions, I highlight the creation of a module where all the locations (sedes) were listed. From there, users could access several options: view the report, edit the location’s information, and open a view that displayed the internal areas within each location.\nI also developed this detailed view from scratch, which included a chart for each internal area. This chart, also built by me, used Chart.js. It was my first time working with this JavaScript library.\nThe chart allowed users to visualize photovoltaic energy generation by month, by day, or within a custom time range. It also offered filters to choose which inverters to display and which to hide. I remember this task as a challenging one at the time, but looking back now, I realize there were countless simpler ways to implement it.\nI highlight this work because, from that moment to today, I’ve gained a lot of experience and a clearer perspective on how to approach this kind of development.\n\nI also developed the preview view of a report from scratch, as well as the generation of the final report using information provided by the Federal Electricity Commission (CFE). The preview was calculated and stored in the database for later reference.This report was used by the University of Guadalajara (UDG) to demonstrate that the solar panels actually generate economic savings and have a positive impact on the environment.It included calculations such as the amount of money saved, the percentage of green energy relative to total consumption, net billed consumption, among other relevant data."
    },
    "portfolio": {
      "title": "My Portfolio",
      "description": "Personal site to showcase my projects and skills",
      "contribution": "Full design and development using Nuxt 3 and Tailwind CSS."
    }
  },
  "experiences": {
    "university": {
        "title": "CUCEI - Computer Engineering",
        "description": "Graduated with a degree in Computer Engineering.\n CUCEI is part of the University of Guadalajara, one of the most prestigious educational institutions in Mexico. \n\n During my time at CUCEI, I gained a solid foundation in programming, databases, and software development, which allowed me to develop essential technical and analytical skills for my career as a software developer."
    },
    "mtsoftech": {
        "description": "My first job as a web developer, where I learned a lot about software development and the importance of teamwork.\n\n This experience gave me my first professional lessons and valuable knowledge that helped shape my career."
    },
    "cucei": {
        "title": "CUCEI Development Department",
        "description": "I started here as an intern and later became a scholarship holder in a friendly and collaborative environment.\n\n During this time, I learned a lot about web development, strengthened my teamwork skills, and focused on writing clean and maintainable code. It was an incredible and warm team, where I built friendships and gained valuable experience."
    },
    "netcommerce": {
        "description": "Netcommerce is a digital marketing agency with over 26 years of experience, specializing in web design and development. They are pioneers of e-commerce in Mexico and experts in social media.\n\n At Netcommerce, I’ve developed both technical and soft skills, working on legacy web applications as well as projects from scratch. I’ve also improved my leadership abilities, teamwork, and even personal skills. I’ve had the opportunity to work alongside an amazing and talented team."
    }
}
}