{
    "home": "Inicio",
    "about": "Acerca de",
    "aboutme": "Acerca de mí",
    "blog": "Blog",
    "contact": "Contacto",
    "login": "Iniciar sesión",
    "register": "Registrarse",
    "openmenu": "Abrir menú",
    "homewelcome": "Bienvenido a mi mundo",
    "Software Engineer": "Ingeniero de Software",
    "PHP Developer": "Desarrollador PHP",
    "Web Developer": "Desarrollador Web",
    "Full Stack Developer": "Desarrollador Full Stack",
    "a_welcome": "un",
    "hi_welcome": "Hola, soy",
    "description" : "Descripción",
    "contribution" : "Contribución",
    "technologies" : "Tecnologias",
    "view project" : "Ver proyecto",
    "Coming soon" : "Próximamente",
    "Send": "Enviar",
    "changelang": "Cambiar idioma",
    "contactme":{
      "title": "¿Quieres conocerme?",
      "label": "Tu mensaje",
      "content": "Hola, tengo interés en tu perfil profesional porque...",
      "emailsubject": "FB - Contact via portfolio"
    },
    "dates": {
      "start" : "Fecha Inicio",
      "end" : "Fecha Fin",
      "present" : "Presente"
    },
    "aboutme_content": "Ingeniero en Informática egresado del CUCEI, Universidad de Guadalajara, con una sólida formación técnica y experiencia profesional en el Desarrollo Web.\nMi enfoque está en construir soluciones limpias, escalables y orientadas a negocio utilizando tecnologías modernas y guiándome por una filosofía clara de trabajo:",
    "dont_be_a_coder": "No seas un codificador, sé un programador",
    "projects" : {
      "header" : "Mi Portafolio",
      "sub_header": "Explora mis contribuciones profesionales y proyectos destacados",
        "mimo": {
          "title": "MIMO - Motos",
          "description": "Plataforma de gestión para concesionarios de motocicletas",
          "long_description": "Aplicación que gestiona Grupos y Distribuidores, centraliza información de los mismos como contactos, redes sociales, direcciones y horarios, etc.La plataforma permite generar sitios web para cada Grupo basándose en su dominio, con la opción de administrar sus banners (generales como específicos para cada Grupo), además se pueden agregar promociones.\n\nEsta página principal tiene su Landing Page, sus propios banners que son administrable, su listado de modelos/productos, un mapa con sucursales del grupo, entre otros vistas. \n \n El sitio principal permite a los clientes potenciales crear Leads de un producto en específico, la información de dicho cliente se guarda encriptada para salvaguardar la privacidad del mismo.Del lado del administrador se creó un CRM intuitivo para el seguimiento de Leads, dónde se aplica un sistema de roles multi-nivel que garantiza la confidencialidad, en el mismo se aplicó una forma innovadora para la búsqueda de Leads, lo cual fue una tarea intensiva por el manejo de datos encriptados.\n \n La aplicación también tiene end points para generar Leads de diversas aplicaciones, centralizando toda la información sobre motos y simplificando el análisis estadístico.\n\nLa aplicación se creo con una estructura ampliable que facilita futuras adiciones de funcionalidades.",
          "contribution": "Participé en la creación de la aplicación desde su fase inicial, desde el análisis para la implementación de la aplicación, hasta la implementación de la misma, como el deploy ah producción. Durante el desarrollo de toda la aplicación, tomé decisiones, maneje recursos,  y realice el análisis y resolución de problemas.\n\n A nivel técnico, lo que puedo destacar, fue la implementación de una base sólida utilizando patrones de diseño como 'Repository Pattern' y 'Decorator Pattern', además del uso de DTO (Data Transfer Object), VO (Value Object).Esto permitió establecer una estructura escalable y fácil de mantener a lo largo del crecimiento del proyecto. \n\n También implementé Laravel Scout para mejorar las búsquedas dentro del panel administrativo, especialmente en el módulo de leads, utilizando Meilisearch como driver. Configuré el servicio y lo desplegué directamente en el servidor.\n\n Actualmente, le sigo dando mantenimiento a la aplicación para la optimización y mejora del mismo, creando nuevos módulos, como creando algoritmo para la automatización del sitio."
        },
        "ekar": {
          "title": "Ekar de Gas",
          "description": "Plataforma Ecommerce",
          "long_description": "",
          "contribution": "Desarrollé el backend con Laravel y optimicé los procesos de inventario"
        },
        "tubin": {
          "title": "Tubin",
          "description": "Plataforma Ecommerce",
          "long_description": "",
          "contribution": "Desarrollé el backend con Laravel y optimicé los procesos de inventario"
        },
        "solarudg": {
          "title": "Solar UDG",
          "description": "Proyecto final universidad",
          "long_description": "",
          "contribution": "Desarrollé el backend con Laravel y optimicé los procesos de inventario"
        },
        "portfolio": {
          "title": "Mi Portafolio",
          "description": "Sitio personal para mostrar mis proyectos y habilidades",
          "contribution": "Diseño y desarrollo completo con Nuxt 3 y Tailwind CSS"
        }
      },
    "experiences" : {
        "university": {
            "title": "CUCEI - Ingeniería Informática",
            "description": "Graduado de la carrera de informática.\n CUCEI es la Universidad de Guadalajara, una de las instituciones educativas más importantes de México. \n\n Durante mi tiempo en CUCEI, adquirí una sólida base en programación, bases de datos, y desarrollo de software, lo que me permitió desarrollar habilidades técnicas y analíticas esenciales para mi carrera como desarrollador de software."
        },
        "mtsoftech": {
            "description": "Mi primer trabajo como desarrollador web, donde aprendí mucho sobre el desarrollo de software y la importancia de la colaboración en equipo.\n\n De este lugar me lleve mis primeras experiencias laborales y un gran aprendizaje."
        },
        "cucei": {
            "title": "Área de Desarrollo CUCEI",
            "description": "Inicie con mis prácticas y continúe como becario un ambiente muy amigable y colaborativo. \n\n En este lugar aprendí mucho sobre desarrollo web, desarrollé mis habilidades de trabajo en equipo, además del desarrollo de código limpio y mantenibles. Un equipo impresionante y cálido, me llevé amistades y un gran aprendizaje."
        },
        "netcommerce": {
            "description": "Netcommerce es una agencia de marketing digital con más de 26 años de experiencia, especializados en diseño y desarrollo web, pioneros del comercio electrónico en México y expertos en redes sociales. \n\n En Netcommerce, he desarrollado muchas habilidades blandas como técnicas, desde el desarrollo de aplicaciones web legacy hasta aplicaciones desde sus inicios, además de aprender infinidad de habilidades técnicas enfocadas en desarrollo web, mejoré mis habilidades como líder, como equipo, inclusive como amigo, y he tenido la oportunidad de trabajar con un equipo increíble y talentoso."
        }
    }
}