{
    "home": "Inicio",
    "about": "Acerca de",
    "aboutme": "Acerca de mí",
    "blog": "Blog",
    "contact": "Contacto",
    "login": "Iniciar sesión",
    "register": "Registrarse",
    "openmenu": "Abrir menú",
    "homewelcome": "Bienvenido a mi mundo",
    "Software Engineer": "Ingeniero de Software",
    "PHP Developer": "Desarrollador PHP",
    "Web Developer": "Desarrollador Web",
    "Full Stack Developer": "Desarrollador Full Stack",
    "a_welcome": "un",
    "hi_welcome": "Hola, soy",
    "description" : "Descripción",
    "contribution" : "Contribución",
    "technologies" : "Tecnologias",
    "view project" : "Ver proyecto",
    "Coming soon" : "Próximamente",
    "Send": "Enviar",
    "changelang": "Cambiar idioma",
    "contactme":{
      "title": "¿Quieres conocerme?",
      "label": "Tu mensaje",
      "content": "Hola, tengo interés en tu perfil profesional porque...",
      "emailsubject": "FB - Contact via portfolio"
    },
    "dates": {
      "start" : "Fecha Inicio",
      "end" : "Fecha Fin",
      "present" : "Presente"
    },
    "aboutme_content": "Ingeniero en Informática egresado del CUCEI, Universidad de Guadalajara, con una sólida formación técnica y experiencia profesional en el Desarrollo Web.\nMi enfoque está en construir soluciones limpias, escalables y orientadas a negocio utilizando tecnologías modernas y guiándome por una filosofía clara de trabajo:",
    "dont_be_a_coder": "No seas un codificador, sé un programador",
    "projects" : {
      "header" : "Mi Portafolio",
      "sub_header": "Explora mis contribuciones profesionales y proyectos destacados",
        "mimo": {
          "title": "MIMO - Motos",
          "description": "Plataforma de gestión para concesionarios de motocicletas",
          "long_description": "Aplicación que gestiona Grupos y Distribuidores, centraliza información de los mismos como contactos, redes sociales, direcciones y horarios, etc.La plataforma permite generar sitios web para cada Grupo basándose en su dominio, con la opción de administrar sus banners (generales como específicos para cada Grupo), además se pueden agregar promociones.\n\nEsta página principal tiene su Landing Page, sus propios banners que son administrable, su listado de modelos/productos, un mapa con sucursales del grupo, entre otros vistas. \n \n El sitio principal permite a los clientes potenciales crear Leads de un producto en específico, la información de dicho cliente se guarda encriptada para salvaguardar la privacidad del mismo.Del lado del administrador se creó un CRM intuitivo para el seguimiento de Leads, dónde se aplica un sistema de roles multi-nivel que garantiza la confidencialidad, en el mismo se aplicó una forma innovadora para la búsqueda de Leads, lo cual fue una tarea intensiva por el manejo de datos encriptados.\n \n La aplicación también tiene end points para generar Leads de diversas aplicaciones, centralizando toda la información sobre motos y simplificando el análisis estadístico.\n\nLa aplicación se creo con una estructura ampliable que facilita futuras adiciones de funcionalidades.",
          "contribution": "Participé en la creación de la aplicación desde su fase inicial, desde el análisis para la implementación de la aplicación, hasta la implementación de la misma, como el deploy ah producción. Durante el desarrollo de toda la aplicación, tomé decisiones, maneje recursos,  y realice el análisis y resolución de problemas.\n\n A nivel técnico, lo que puedo destacar, fue la implementación de una base sólida utilizando patrones de diseño como 'Repository Pattern' y 'Decorator Pattern', además del uso de DTO (Data Transfer Object), VO (Value Object).Esto permitió establecer una estructura escalable y fácil de mantener a lo largo del crecimiento del proyecto. \n\n También implementé Laravel Scout para mejorar las búsquedas dentro del panel administrativo, especialmente en el módulo de leads, utilizando Meilisearch como driver. Configuré el servicio y lo desplegué directamente en el servidor.\n\n Actualmente, le sigo dando mantenimiento a la aplicación para la optimización y mejora del mismo, creando nuevos módulos, como creando algoritmo para la automatización del sitio."
        },
        "ekar": {
          "title": "Ekar de Gas",
          "description": "Plataforma e-commerce para una empresa historica en Jalisco.",
          "long_description": "Aplicación e-commerce desarrollada a medida para Ekar de Gas, integrando todos los elementos que conlleva una tienda en línea: productos, marcas, categorías, reseñas, stock, almacenes, clientes, órdenes, métodos de envío, métodos de pago, entre otros.\n La aplicación tiene como valor agregado una conexión directa con SAP para la gestión de productos, stock en almacenes, precios, descuentos, así como la creación automática de órdenes.",
          "contribution": "Dentro de mis contribuciones, destaco la integración con SAP, un tema que fue nuevo para mí y bastante intensivo, ya que se realizó una conexión directa utilizando XML, además de consultas directas (RAW queries) a la base de datos. Esto implicó un proceso de investigación considerable para poder entender y aplicar lo necesario para lograr una conexión funcional con SAP.\nPor otro lado, trabajé en la creación de una paquetería para el manejo del carrito de compras, así como en la implementación completa del proceso de checkout. \n\n Este fue mi primer acercamiento a un e-commerce, y a partir de aquí aprendí y adquirí mucha experiencia sobre lo que implica construir una tienda en línea desde cero. Actualmente, sigo dando mantenimiento a la aplicación, mejorando módulos, realizando optimizaciones y desarrollé una nueva paquetería para integrar el nuevo método de pago con Mercado Pago."
        },
        "tubin": {
          "title": "Tubin",
          "description": "Plataforma e-commerce",
          "long_description": "Aplicación e-commerce desarrollada a medida para Tubin, integrando todos los elementos que conlleva una tienda en línea: productos,  marcas, categorías, stock, clientes, órdenes, entre otros.\n La aplicación tiene como valor agregado una conexión con Oracle mediante el uso de APIS, para la gestión de productos, stock, precios, así como la creación de órdenes en el sistema del cliente.",
          "contribution": "En este proyecto tuve un rol más cercano a un perfil Senior, ya que estuve a cargo de un equipo. Me encargaba de tomar decisiones continuamente para la solución de problemas, incluso teniendo reuniones directas con el cliente. También revisaba de forma constante el trabajo de los juniors y era responsable de realizar los despliegues a los entornos de pruebas. Si surgía algún bug, lo resolvía mediante hotfixes.\n\nPor el lado técnico, trabajando como programador, implementamos la conexión con Oracle utilizando el patrón de diseño Strategy Pattern. Esto permitió que la aplicación no dependiera de un entorno sandbox del cliente ni de una conexión directa a su API. En su lugar, se creó un entorno interno dentro de la propia aplicación, permitiendo que cualquier persona que instalara el proyecto pudiera usarlo sin necesidad de contar con accesos externos a la API."
        },
        "solarudg": {
          "title": "Solar UDG",
          "description": "Proyecto final universidad",
          "long_description": "En colaboración con un equipo interno del área de desarrollo de CUCEI, tuve el privilegio de participar en el diseño y desarrollo de un sistema administrativo, cuyo propósito principal es el monitoreo centralizado de todos los sistemas fotovoltaicos instalados en las sedes de la Universidad de Guadalajara.\n El sistema se organizó de manera eficiente, agrupando los sistemas fotovoltaicos por sede y proporcionando información precisa sobre la generación de energía en tiempo real, mensual y por períodos específicos. Para garantizar la accesibilidad y visualización de datos relevantes, creamos gráficas dinámicas que permiten una comprensión intuitiva del rendimiento fotovoltaico.\nUna de las características clave de este proyecto fue la implementación de APIs para obtener y procesar datos esenciales. Además, se creó una funcionalidad para cargar y procesar archivos de la Comisión Federal de Electricidad (CFE), utilizando algoritmos inteligentes que extraen y depuran datos valiosos para su posterior análisis.",
          "contribution": "Dentro de mis contribuciones, destaco la creación de un módulo donde se listaban las sedes. Desde ahí se podía acceder a varias opciones: ver el reporte, modificar la información de la sede y consultar una vista donde se desglosaban las ubicaciones dentro de la misma.\nTambién desarrollé desde cero esta vista de ubicaciones, la cual incluía una gráfica por cada una de ellas. Esta gráfica, que también fue desarrollada por mí, utilizaba Chart.js. Fue la primera vez que usé esta librería de JavaScript.\nLa gráfica permitía visualizar la generación de energía fotovoltaica por mes, por día o por un periodo específico, además de ofrecer filtros para seleccionar qué inversores mostrar y cuáles no. Recuerdo este trabajo como un reto complicado en su momento, pero viéndolo ahora, sé que había mil y un formas de resolverlo de forma más sencilla.\nLo destaco porque, desde ese día hasta hoy, he ganado mucha experiencia y una mejor perspectiva para afrontar este tipo de desarrollos.\n\nTambién desarrollé desde cero la vista preview de un reporte, así como la generación del reporte final utilizando información proveniente de la CFE(Comisión Federal de Electricidad). La vista previa se calculaba y se guardaba en base de datos para su posterior consulta.Este reporte era utilizado por la UDG como sustento para demostrar que los paneles solares realmente generan ahorro económico y tienen un impacto positivo en el medio ambiente.Incluía cálculos como el monto ahorrado en dinero, el porcentaje de energía verde respecto al consumo total, el consumo neto facturado, entre otros datos relevantes."
        },
        "jb_refacciones": {
          "title": "JB - Refacciones",
          "description": "Aplicacion de escritorio",
          "long_description": "La aplicación fue desarrollada para ser utilizada en una refaccionaria, diseñada y creada a medida para cubrir todas las necesidades del negocio a nivel Punto de Venta. Fue mi primer proyecto fuera del ámbito escolar.\n\nLa aplicación funcionaba como un sistema de venta, donde se podían realizar ventas de todos los productos típicos de una refaccionaria. Permitía agregar clientes, manejarles crédito y descuentos, además de poder asignarlos a una empresa.\n Se podían agregar todo tipo de productos, desde autopartes hasta aromatizantes para vehículos.\n También se podían registrar vehículos por marca, modelo, e incluso agregar versiones al modelo.Un punto clave es que las autopartes se relacionaban directamente a los vehículos según su modelo y versión.\n Además, el sistema manejaba un control de stock sencillo y contaba con un buscador rápido para encontrar las refacciones asociadas a un modelo o versión específica.",
          "contribution": "Esta aplicación de escritorio la desarrollé desde cero usando C#. También la preparé para que pudiera instalarse fácilmente, al grado que llegué a instalarla en dos computadoras del negocio y monté la base de datos en el servidor de la empresa. Al final, la aplicación no se utilizó porque surgieron muchas necesidades nuevas que implicaban más actualizaciones, pero para mí fue mi primera experiencia real y de ese proyecto aprendí muchas cosas."
        },
        "portfolio": {
          "title": "Mi Portafolio",
          "description": "Sitio personal para mostrar mis proyectos y habilidades",
          "contribution": "Diseño y desarrollo completo con Nuxt 3 y Tailwind CSS"
        },
        "callcenter": {
          "title": "Honda Call center",
          "description": "Honda México",
          "long_description": "Sitio para equipo de callcenter y manejo de leads."
        },
        "insumos": {
          "title": "Insumos Cerveceros",
          "description": "Plataforma e-commerce",
          "long_description": "Sitio para equipo de callcenter y manejo de leads."
        }
      },
    "experiences" : {
        "university": {
            "title": "CUCEI - Ingeniería Informática",
            "description": "Graduado de la carrera de informática.\n CUCEI es la Universidad de Guadalajara, una de las instituciones educativas más importantes de México. \n\n Durante mi tiempo en CUCEI, adquirí una sólida base en programación, bases de datos, y desarrollo de software, lo que me permitió desarrollar habilidades técnicas y analíticas esenciales para mi carrera como desarrollador de software."
        },
        "mtsoftech": {
            "description": "Mi primer trabajo como desarrollador web, donde aprendí mucho sobre el desarrollo de software y la importancia de la colaboración en equipo.\n\n De este lugar me lleve mis primeras experiencias laborales y un gran aprendizaje."
        },
        "cucei": {
            "title": "Área de Desarrollo CUCEI",
            "description": "Inicie con mis prácticas y continúe como becario un ambiente muy amigable y colaborativo. \n\n En este lugar aprendí mucho sobre desarrollo web, desarrollé mis habilidades de trabajo en equipo, además del desarrollo de código limpio y mantenibles. Un equipo impresionante y cálido, me llevé amistades y un gran aprendizaje."
        },
        "netcommerce": {
            "description": "Netcommerce es una agencia de marketing digital con más de 26 años de experiencia, especializados en diseño y desarrollo web, pioneros del comercio electrónico en México y expertos en redes sociales. \n\n En Netcommerce, he desarrollado muchas habilidades blandas como técnicas, desde el desarrollo de aplicaciones web legacy hasta aplicaciones desde sus inicios, además de aprender infinidad de habilidades técnicas enfocadas en desarrollo web, mejoré mis habilidades como líder, como equipo, inclusive como amigo, y he tenido la oportunidad de trabajar con un equipo increíble y talentoso."
        }
    }
}